In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [22]:
## exercise 6.1
df = pd.DataFrame(data={"features":[2.4,3.6,4.5,7.8], "labels":[1,2,3,4]})

In [23]:
df

   features  labels
0       2.4       1
1       3.6       2
2       4.5       3
3       7.8       4

In [24]:
## exercise 6.2
df = df.rename(columns={"labels":"label"})

In [25]:
df

   features  label
0       2.4      1
1       3.6      2
2       4.5      3
3       7.8      4

In [7]:
## exercise 6.3
iris = sns.load_dataset('iris')

In [10]:
iris.sort_values("species", ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

In [12]:
iris.value_counts("species").to_frame()

            count
species
setosa         50
versicolor     50
virginica      50

In [ ]:
## exercise 6.5
len(iris[(iris.petal_length <= 1.4)|(iris.petal_length >= 1.6)])

In [27]:
## exercise 6.6
iris["min"] = iris.apply(lambda x: min(x.petal_length,x.petal_width), axis=1)

In [28]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  min
0           5.1          3.5           1.4          0.2  setosa  0.2
1           4.9          3.0           1.4          0.2  setosa  0.2
2           4.7          3.2           1.3          0.2  setosa  0.2
3           4.6          3.1           1.5          0.2  setosa  0.2
4           5.0          3.6           1.4          0.2  setosa  0.2

In [29]:
sum(iris.petal_length <= iris.petal_width)

0

In [32]:
iris[["petal_length", "petal_width"]].idxmin(axis=1).count()

150

In [39]:
## exercise 6.7
pd.pivot_table(iris, 
               values = ["sepal_width", "petal_width"],
               columns = ["species"],
               aggfunc={np.median, np.mean})

species             setosa  versicolor  virginica
petal_width mean     0.246       1.326      2.026
            median   0.200       1.300      2.000
sepal_width mean     3.428       2.770      2.974
            median   3.400       2.800      3.000

In [40]:
pd.pivot_table(iris, 
               values = ["sepal_width", "petal_width"],
               columns = ["species"],
               aggfunc=[np.median, np.mean])

            median                        mean
species     setosa versicolor virginica setosa versicolor virginica
petal_width    0.2        1.3       2.0  0.246      1.326     2.026
sepal_width    3.4        2.8       3.0  3.428      2.770     2.974

In [41]:
pd.pivot_table(iris, 
               values = ["sepal_width", "petal_width"],
               columns = ["species"],
               aggfunc=[np.median, np.mean]).T

                   petal_width  sepal_width
       species
median setosa            0.200        3.400
       versicolor        1.300        2.800
       virginica         2.000        3.000
mean   setosa            0.246        3.428
       versicolor        1.326        2.770
       virginica         2.026        2.974

In [ ]:
## exercise 6.8

In [25]:
df1 = pd.DataFrame(data={"names": ["name1","name2","name3"], "age": [24, 25, 26]})

In [26]:
df1

   names  age
0  name1   24
1  name2   25
2  name3   26

In [27]:
df2 = pd.DataFrame(data={"names": ["name1","name2","name4"], "height": [50, 76, 64]})

In [28]:
df2

   names  height
0  name1      50
1  name2      76
2  name4      64

In [39]:
df3 = pd.merge(df1, df2, on="names")
## on= can work with keys too

In [30]:
df3

   names  age  height
0  name1   24      50
1  name2   25      76

In [31]:
df1 = df1.set_index("names")

In [32]:
df1

       age
names
name1   24
name2   25
name3   26

In [33]:
df2 = df2.set_index("names")

In [34]:
df2

       height
names
name1      50
name2      76
name4      64

In [35]:
df4 = df1.join(df2, how="outer")

In [36]:
df4

        age  height
names
name1  24.0    50.0
name2  25.0    76.0
name3  26.0     NaN
name4   NaN    64.0

In [38]:
pd.merge(df1, df2, on="names", how="inner")

       age  height
names
name1   24      50
name2   25      76

In [40]:
## exercise 6.10
cats = pd.DataFrame({'breed': ["persian", "persian", "siamese","himalyan","burnese"],
                    "color": ["calico", "white","seal point","cream","sable"]})

In [41]:
cats

      breed       color
0   persian      calico
1   persian       white
2   siamese  seal point
3  himalyan       cream
4   burnese       sable

In [53]:
dums = pd.get_dummies(cats, drop_first=True, prefix=["breed", "color"], dtype=int)

In [57]:
dums.T

                  0  1  2  3  4
breed_himalyan    0  0  0  1  0
breed_persian     1  1  0  0  0
breed_siamese     0  0  1  0  0
color_cream       0  0  0  1  0
color_sable       0  0  0  0  1
color_seal point  0  0  1  0  0
color_white       0  1  0  0  0

In [56]:
pd.__version__

'2.0.3'

In [60]:
## exercise 6.11
import sqlite3
import os

In [61]:
os.chdir("C:/Users/jacqu/OneDrive/Documents/MSDS/datasets")

In [66]:
db = sqlite3.connect('./winereviews.db')

In [71]:
raw = pd.read_csv("./winereviews.csv").set_index("id")

In [72]:
raw.head().T

id,0,1,2,3,4
country,Italy,Portugal,US,US,US
description,"Aromas include tropical fruit, broom, brimston...","This is ripe and fruity, a wine that is smooth...","Tart and snappy, the flavors of lime flesh and...","Pineapple rind, lemon pith and orange blossom ...","Much like the regular bottling from 2012, this..."
designation,Vulkà Bianco,Avidagos,NaN,Reserve Late Harvest,Vintner's Reserve Wild Child Block
points,87,87,87,87,87
price,NaN,15.0,14.0,13.0,65.0
province,Sicily & Sardinia,Douro,Oregon,Michigan,Oregon
region_1,Etna,NaN,Willamette Valley,Lake Michigan Shore,Willamette Valley
region_2,NaN,NaN,Willamette Valley,NaN,Willamette Valley
taster_name,Kerin O’Keefe,Roger Voss,Paul Gregutt,Alexander Peartree,Paul Gregutt
taster_twitter_handle,@kerinokeefe,@vossroger,@paulgwine,NaN,@paulgwine
title,Nicosia 2013 Vulkà Bianco (Etna),Quinta dos Avidagos 2011 Avidagos Red (Douro),Rainstorm 2013 Pinot Gris (Willamette Valley),St. Julian 2013 Reserve Late Harvest Riesling ...,Sweet Cheeks 2012 Vintner's Reserve Wild Child...
variety,White Blend,Portuguese Red,Pinot Gris,Riesling,Pinot Noir
winery,Nicosia,Quinta dos Avidagos,Rainstorm,St. Julian,Sweet Cheeks

In [73]:
raw.isna().sum()

country                     63
description                  0
designation              37465
points                       0
price                     8996
province                    63
region_1                 21247
region_2                 79460
taster_name              26244
taster_twitter_handle    31213
title                        0
variety                      1
winery                       0
dtype: int64

In [74]:
raw = raw.dropna().drop_duplicates().reset_index().set_index('id')

In [76]:
raw.isna().sum()

country                  0
description              0
designation              0
points                   0
price                    0
province                 0
region_1                 0
region_2                 0
taster_name              0
taster_twitter_handle    0
title                    0
variety                  0
winery                   0
dtype: int64

In [77]:
raw.to_sql('raw', db, if_exists='replace')

20493

In [94]:
taster = raw[["taster_name", "taster_twitter_handle"]].drop_duplicates().reset_index().set_index(["taster_name", "taster_twitter_handle"])

In [95]:
taster.index.names = ["taster_name", "taster_twitter_handle"]

In [96]:
taster.to_sql("taster", db, index=True, if_exists='replace', index_label=taster.index.names)

11

In [97]:
taster

                                            id
taster_name       taster_twitter_handle
Paul Gregutt      @paulgwine                 4
Virginie Boone    @vboone                   10
Matt Kettmann     @mattkettmann             23
Sean P. Sullivan  @wawinereport             62
Jim Gordon        @gordone_cellars         199
Roger Voss        @vossroger               388
Susan Kostrzewa   @suskostrzewa            409
Joe Czerwinski    @JoeCz                  6028
Michael Schachner @wineschach             6030
Lauren Buzzeo     @laurbuzz              23556
Christina Pickard @winewchristina        59324

In [100]:
db.close()